
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-CHECK-BALANCE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01 WS-BALANCE          PIC 9(10)V99 VALUE 01650.00.
          01 WS-WITHDRAWAL-AMOUNT PIC 9(10)V99 VALUE 01000.00.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           IF WS-WITHDRAWAL-AMOUNT <= WS-BALANCE
               DISPLAY "ISLEM ONAYLANDI: BAKIYE YETERLI"
               SUBTRACT WS-WITHDRAWAL-AMOUNT FROM WS-BALANCE
           ELSE
               DISPLAY "ISLEM REDDEDILDI: BAKIYE YETERSIZ"
           END-IF.

           STOP RUN.
