
       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBOL-CHECK-BALANCE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01 WS-ACCOUNT-STATUS  PIC X(06)   VALUE "AKTIVE".
          01 WS-ACCOUNT-BALANCE PIC 9(6)V99 VALUE 05000.00.
          01 WS-TRANFER-AMOUNT  PIC 9(6)V99 VALUE 02000.00.
          01 WS-DAILY-LIMIT     PIC 9(6)V99 VALUE 01000.00.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           IF WS-ACCOUNT-STATUS = "AKTIVE"
               AND WS-TRANFER-AMOUNT <= WS-ACCOUNT-BALANCE
               AND NOT (WS-TRANFER-AMOUNT > WS-DAILY-LIMIT)
                DISPLAY "TRANSFER ISLEM ONAYLANDI: BAKIYE YETERLI"
           ELSE
               DISPLAY "TRANSFER ISLEM REDDEDILDI: BAKIYE YETERSIZ"
           END-IF.

           STOP RUN.
